<?php
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2007 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------

return array(
    //模块名称[必填]
    'modulename' => '数据库',
    //模块简介[选填]
    'introduce' => '数据库模块，支持备份，还原，优化，修复，下载，导入',
    //模块作者[选填]
    'author' => 'yzncms',
    //作者地址[选填]
    'authorsite' => 'http://www.yzncms.com',
    //作者邮箱[选填]
    'authoremail' => '530765310@qq.com',
    //版本号，请不要带除数字外的其他字符[必填]
    'version' => '1.0.0',
    //适配最低yzncms版本[必填]
    'adaptation' => '1.0.0',
    //签名[必填]
    'sign' => 'b19cc279ed484c13c96c2f7142e2f437',
    //依赖模块
    'depend' => [],
    //行为注册
    'tags' => [],
    //缓存，格式：缓存key=>array('module','model','action')
    'cache' => [],
    // 数据表，请加表前缀yzn[有数据库表时必填]
    'tables' => [],

    //数据库导出配置参数
    'data_backup_path' => './Data/Backup/', //数据库备份根路径 路径必须以 / 结尾
    'data_backup_part_size' => 20971520, //数据库备份卷大小 该值用于限制压缩后的分卷最大长度。单位：B；建议设置20M
    'data_backup_compress' => 1, //0:不压缩 1:启用压缩 压缩备份文件需要PHP环境支持gzopen,gzwrite函数
    'data_backup_compress_level' => 9, //1:普通 4:一般 9:最高 数据库备份文件的压缩级别，该配置在开启压缩时生效
);
