<?php
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 会员金钱变动模型
// +----------------------------------------------------------------------
namespace app\common\model;

use think\Model;

class AmountLog extends Model
{

    // 表名
    protected $name = 'user_amount_log';
    // 开启自动写入时间戳字段
    protected $autoWriteTimestamp = true;
    protected $updateTime         = false;
}
