<?php
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 后台登录页
// +----------------------------------------------------------------------
namespace app\admin\controller;

use think\Controller;

class Login extends Controller
{
    public function index()
    {
        if ($this->request->isPost()) {
            $this->success('登录成功！', url('Index/index'));
        } else {
            return $this->fetch();
        }

    }

}
