<?php
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2007 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------
return array(
    'text' => '单行文本',
    'textarea' => '多行文本',
    'editor' => '编辑器',
    'catid' => '栏目',
    'title' => '标题',
    'box' => '选项',
    'image' => '图片',
    'images' => '多图片',
    'number' => '数字',
    'datetime' => '日期和时间',
    'keyword' => '关键词',
    'tags' => 'Tags标签',
    'author' => '作者',
    'copyfrom' => '来源',
    'islink' => '转向链接',
    'template' => '模板',
    'pages' => '分页选择',
    'typeid' => '类别',
    'posid' => '推荐位',
    'downfile' => '单文件上传',
    'downfiles' => '多文件上传',
    'omnipotent' => '万能字段',
);
