<?php
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 采集模型
// +----------------------------------------------------------------------
namespace app\admin\model\collection;

use think\Model;

class Nodes extends Model
{
    protected $name = 'collection_node';

    // 设置json类型字段
    protected $json = ['list_config', 'content_config'];

    // 设置JSON数据返回数组
    protected $jsonAssoc = true;
}
