<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 会员模块token设置
// +----------------------------------------------------------------------

return [
    // 复合缓存类型
    'type'     => 'complex',
    'key'   => 'i3d6o32wo8fvs1fvdpwens', // i3d6o32wo8fvs1fvdpwens
    'hashalgo' => 'ripemd160', // 加密方式
    'expire'   => 0,
    // 默认使用的缓存
    'default'  => [
        'type'   => 'Mysql', // 驱动方式
    ],
    // 文件缓存
    'Mysql'     => [
        'type'   => 'Mysql',
        'expire' => 0, // 缓存有效期 0表示永久缓存
    ],
    // redis缓存
    'redis'    => [
        'type'     => 'redis',
        'host'     => '127.0.0.1',
        'port'     => 6379,
        'password' => '',
        'select'      => 0,
        'expire'   => 0,
    ],
];
