<?php
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 上传配置
// +----------------------------------------------------------------------

return [
    /**
     * 上传地址,默认是本地上传
     */
    'uploadurl'  => 'ajax/upload',
    /**
     * CDN地址
     */
    'cdnurl'     => '',
    /**
     * 文件保存格式
     */
    'savekey'    => '/uploads/{year}{mon}{day}/{filemd5}{.suffix}',
    /**
     * 最大可上传大小
     */
    'maxsize'    => '10mb',
    /**
     * 可上传的文件类型
     */
    'mimetype'   => 'jpg,png,bmp,jpeg,gif,webp,zip,rar,xls,xlsx,wav,mp4,mp3,webm',
    /**
     * 是否支持批量上传
     */
    'multiple'   => false,
    /**
     * 是否支持分片上传
     */
    'chunking'   => false,
    /**
     * 默认分片大小
     */
    'chunksize'  => 2097152,
    /**
     * 完整URL模式
     */
    'fullmode'   => false,
    /**
     * 缩略图样式
     */
    'thumbstyle' => '',
];
