<?php
error_reporting(E_ERROR | E_PARSE);
// +----------------------------------------------------------------------
// | Yzncms [ 御宅男工作室 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2007 http://yzncms.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 御宅男 <530765310@qq.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 系统相关设置
    // +----------------------------------------------------------------------
    // 文件上传路径
    'upload_path' => 'uploads/',
    //最大缓存用户数
    'USER_MAX_CACHE' => 1000,
    //管理员用户ID
    'USER_ADMINISTRATOR' => 1,

    // +----------------------------------------------------------------------
    // | UCenter客户端配置
    // +----------------------------------------------------------------------
    'uc_app_id' => 1, //应用ID
    'uc_api_type' => 'Model', //可选值 Model / Service
    'uc_auth_key' => 's"0~;%aX)?LbI-S=l@C$}cVGj!`*KoAz8q^_7.M|', //加密KEY

    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------
    // 应用命名空间
    'app_namespace' => 'app',
    // 应用调试模式
    'app_debug' => true,
    // 应用Trace
    'app_trace' => true,
    // 注册的根命名空间
    'root_namespace' => ['addons' => ROOT_PATH . 'addons' . DS],

    // +----------------------------------------------------------------------
    // | 模块设置
    // +----------------------------------------------------------------------
    // 默认模块名
    'default_module' => 'home',
    // 禁止访问模块
    'deny_module_list' => ['common', 'runtime'],

    // 默认跳转页面对应的模板文件
    'dispatch_error_tmpl' => APP_PATH . 'admin' . DS . 'view' . DS . 'public' . DS . 'dispatch_jump.tpl', // 默认错误跳转对应的模板文件
    'dispatch_success_tmpl' => APP_PATH . 'admin' . DS . 'view' . DS . 'public' . DS . 'dispatch_jump.tpl', // 默认成功跳转对应的模板文件

    // +----------------------------------------------------------------------
    // | 会话设置
    // +----------------------------------------------------------------------

    'session' => [
        'id' => '',
        // SESSION_ID的提交变量,解决flash上传跨域
        'var_session_id' => '',
        // SESSION 前缀
        'prefix' => 'think',
        // 驱动方式 支持redis memcache memcached
        'type' => '',
        // 是否自动开启 SESSION
        'auto_start' => true,
    ],

    // +----------------------------------------------------------------------
    // | 验证码设置
    // +----------------------------------------------------------------------
    'captcha' => [
        // 验证码字体大小(px)
        'fontSize' => 15,
        // 验证码图片高度
        'imageH' => 40,
        // 验证码图片宽度
        'imageW' => 110,
        // 验证码位数
        'length' => 4,
    ],
];
